app/controllers/themes_controller.rb

    def index
        @themes = Theme.all.collect do |theme|
            {
                :key => 'f' + theme.id.to_s,
                :title => theme.title,
                :folder => true,
                :children => theme.concepts.order('lower(title)').collect do |c|
---
SELECT "themes".* FROM "themes"
SELECT "concepts".* FROM "concepts" INNER JOIN "themes_concepts" ON "concepts"."id" = "themes_concepts"."concept_id" WHERE "themes_concepts"."theme_id" = 1 ORDER BY lower(title)